{"class_name": "Model", "config": {"name": "model_150", "layers": [{"name": "input_150", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128], "dtype": "float32", "sparse": false, "name": "input_150"}, "inbound_nodes": []}, {"name": "conv1d_448", "class_name": "Conv1D", "config": {"name": "conv1d_448", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_150", 0, 0, {}]]]}, {"name": "activation_150", "class_name": "Activation", "config": {"name": "activation_150", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1d_448", 0, 0, {}]], [["conv1d_449", 0, 0, {}]], [["conv1d_450", 0, 0, {}]], [["dense_448", 0, 0, {}]], [["dense_449", 0, 0, {}]]]}, {"name": "batch_normalization_448", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_448", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_150", 0, 0, {}]]]}, {"name": "average_pooling1d_299", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_299", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_448", 0, 0, {}]]]}, {"name": "conv1d_449", "class_name": "Conv1D", "config": {"name": "conv1d_449", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling1d_299", 0, 0, {}]]]}, {"name": "batch_normalization_449", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_449", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_150", 1, 0, {}]]]}, {"name": "average_pooling1d_300", "class_name": "AveragePooling1D", "config": {"name": "average_pooling1d_300", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}, "inbound_nodes": [[["batch_normalization_449", 0, 0, {}]]]}, {"name": "conv1d_450", "class_name": "Conv1D", "config": {"name": "conv1d_450", "trainable": true, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling1d_300", 0, 0, {}]]]}, {"name": "batch_normalization_450", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_450", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["activation_150", 2, 0, {}]]]}, {"name": "global_max_pooling1d_150", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_150", "trainable": true}, "inbound_nodes": [[["batch_normalization_450", 0, 0, {}]]]}, {"name": "global_average_pooling1d_150", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_150", "trainable": true}, "inbound_nodes": [[["batch_normalization_450", 0, 0, {}]]]}, {"name": "concatenate_150", "class_name": "Concatenate", "config": {"name": "concatenate_150", "trainable": true, "axis": 1}, "inbound_nodes": [[["global_max_pooling1d_150", 0, 0, {}], ["global_average_pooling1d_150", 0, 0, {}]]]}, {"name": "dense_448", "class_name": "Dense", "config": {"name": "dense_448", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_150", 0, 0, {}]]]}, {"name": "dropout_299", "class_name": "Dropout", "config": {"name": "dropout_299", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_150", 3, 0, {}]]]}, {"name": "dense_449", "class_name": "Dense", "config": {"name": "dense_449", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_299", 0, 0, {}]]]}, {"name": "dropout_300", "class_name": "Dropout", "config": {"name": "dropout_300", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_150", 4, 0, {}]]]}, {"name": "dense_450", "class_name": "Dense", "config": {"name": "dense_450", "trainable": true, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_300", 0, 0, {}]]]}], "input_layers": [["input_150", 0, 0]], "output_layers": [["dense_450", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}